{
  "main": {
    "name": "Daniil Dorosohenko",
    "description": "Developer crafting modern, responsive web applications with React, Next.js, and cutting-edge technologies. Focused on creating exceptional user experiences through clean code and innovative design solutions.",
    "downloadCv": "Download CV",
    "yearsOfExperience": "Years of experience",
    "projects": "Projects",
    "technologies": "Technologies",
    "landings": "Landings"
  },
  "header": {
    "btnContact": "Collaboration",
    "nav": {
      "home": "Home",
      "services": "Services",
      "resume": "Resume",
      "projects": "Projects",
      "contact": "Contact"
    }
  },
  "services": {
    "service1": {
      "title": "Full-Stack Website Development",
      "items": [
        "Single-page sites (landing pages)",
        "Corporate websites",
        "Portfolio sites, photographer sites, personal pages",
        "Marketing microsites"
      ]
    },
    "service2": {
      "title": "Web Application UI Development",
      "items": [
        "Dashboards, admin panels",
        "SaaS application interfaces",
        "User portals"
      ]
    },
    "service3": {
      "title": "API and Backend Integration",
      "items": [
        "REST API / GraphQL integration",
        "Authorization and authentication (OAuth, JWT, Firebase)",
        "Form handling and data submission"
      ]
    },
    "service4": {
      "title": "Performance and SEO Optimization",
      "items": [
        "SSR (Server-Side Rendering)",
        "SSG (Static Site Generation)",
        "Image and font optimization",
        "Metadata, OpenGraph, SEO structure"
      ]
    },
    "service5": {
      "title": "Responsive Design",
      "items": [
        "Mobile device optimization",
        "Cross-browser compatibility"
      ]
    },
    "service6": {
      "title": "Third-Party Service Integration",
      "items": [
        "Google Analytics, Hotjar",
        "Stripe, PayPal",
        "EmailJS, Formspree, Netlify Forms"
      ]
    },
    "service7": {
      "title": "Website and Application Migration",
      "items": [
        "Migration from Create React App to Next.js",
        "HTML/WordPress to React/Next migration"
      ]
    },
    "service8": {
      "title": "Refactoring and Technical Support",
      "items": [
        "Class components to hooks migration",
        "Code splitting",
        "Performance improvements"
      ]
    },
    "service9": {
      "title": "Component Development",
      "items": [
        "Component development and documentation",
        "Design systems and UI libraries"
      ]
    }
  },
  "contact": {
    "title": "Let's work together",
    "description": "Ready to bring your ideas to life using modern technologies. \n Contact me to discuss your project.",
    "form": {
      "firstName": "First Name",
      "lastName": "Last Name",
      "email": "Email Address",
      "phone": "Phone Number",
      "selectService": "Select a service",
      "message": "Type your message here",
      "sendMessage": "Send Message"
    },
    "info": {
      "phone": "Phone",
      "email": "Email"
    },
    "services": {
      "service1": "Full-Stack Website Development",
      "service2": "Web Application UI Development",
      "service3": "API and Backend Integration",
      "service4": "Performance and SEO Optimization",
      "service5": "Responsive Design",
      "service6": "Third-Party Service Integration",
      "service7": "Website and Application Migration",
      "service8": "Refactoring and Technical Support",
      "service9": "Component Development",
      "service10": "Other"
    }
  },
  "resume": {
    "tabs": {
      "experience": "Experience",
      "skills": "Skills",
      "about": "About Me"
    },
    "about": {
      "title": "About me",
      "description": "I'm a Frontend Developer who values not just writing code, but creating solutions that bring real value to people. I'm driven by the idea of combining aesthetics with functionality — crafting interfaces that are not only visually appealing but also intuitive and user-friendly.\nI enjoy working in teams that embrace openness, knowledge sharing, and a shared commitment to quality. I'm a good listener, quick to adapt to new environments, and always looking for ways to improve the product.\nIn my work, I prioritize structure, attention to detail, and continuous self-improvement. I believe that technology is a tool, and true results come from collaboration, creativity, and responsibility.",
      "info": {
        "name": "Name",
        "phone": "Phone",
        "experience": "Experience",
        "telegram": "Telegram",
        "nationality": "Nationality",
        "email": "Email",
        "freelance": "Freelance",
        "languages": "Languages"
      },
      "values": {
        "name": "Daniil Dorosohenko",
        "phone": "+380 96 014 28 71",
        "experience": "3+ Years",
        "telegram": "@DoroshenkoDan",
        "nationality": "Ukrainian",
        "email": "doroshenko.daniil.a@gmail.com",
        "freelance": "Available",
        "languages": "English, Ukrainian"
      }
    },
    "skills":{
      "title": "My Skills",
      "description":"Here are just the main technologies. The full list can be viewed in my CV, available for download on the main page."
    },
    "experience": {
      "title": "My experience",
      "description": "Frontend Developer with solid experience in building modern, responsive web applications across diverse industries. Skilled in React, Next.js, and TypeScript, with a strong focus on performance optimization, clean architecture, and user-centered design. Proven ability to deliver full-cycle development — from requirement analysis and UI implementation to API integration and deployment. Successfully collaborated with international clients and cross-functional teams, consistently meeting deadlines and maintaining high code quality.",
      "born2codelab": "I contributed to the development of large-scale web platforms across tourism, finance, and security sectors. My focus was on creating intuitive user interfaces and robust business functionality tailored to diverse user needs. Key projects included: Tourism Platform — Designed a user-friendly interface for travelers and a powerful dashboard for property owners, enabling booking management, analytics, and customer communication. Financial Platform for Exporters — Built a technology-driven solution for small and medium-sized enterprises, streamlining financial operations, improving access to export support tools, and ensuring transaction transparency. AI-Powered Security Platform — Developed an innovative system leveraging artificial intelligence to assess risks, respond to incidents, and provide advanced protection for organizations. I was involved in all stages of development — from architecture planning and UI creation to API integration and deployment. Collaborated closely with designers, backend developers, and product managers to ensure performance, responsiveness, and adherence to UI/UX best practices.",
      "upwork": "Developed a wide range of projects—from landing pages and promotional websites to complex web applications with dynamic functionality. Took part in all stages of development, including requirements analysis, architecture design, UI implementation, API integration, and deployment. Worked both independently and within teams, maintaining active communication with clients, preparing estimates and reports, and consistently meeting deadlines. Regularly optimized performance, updated codebases, introduced new UI solutions, and ensured alignment with UI/UX guidelines. This experience significantly enhanced my technical expertise, strengthened my ability to make independent decisions, and improved my collaboration skills with clients from various industries.",
      "toptal": "Worked in a cross-functional team to develop small single-page websites and lightweight e-commerce solutions. Used React to ensure responsive design, fast loading times, and API integration. Participated in the full development cycle—from layout to deployment. Implemented animations (Framer Motion), handled forms with Formik and Yup, and maintained code quality using ESLint, Prettier, Stylelint, and CI with Husky. Gained experience in rapid development, team collaboration, and flexible planning.",
      "durations": {
        "born2codelab": "June 2024 - July 2025",
        "upwork": "June 2023 - July 2024",
        "toptal": "February 2022 - June 2023"
      }
    }
  },
  "projects": {
    "peakDefence": {
      "description": "AI platform and methodology for cybersecurity that combines artificial intelligence, graph technologies, and expert support. Wingman AI automates security management, prioritizes risks, reduces alert noise, and ensures compliance with standards. Additionally offers Virtual-CISO services, compliance and risk management."
    },
    "marco": {
      "description": "Fintech platform that simplifies international trade by offering SME companies non-traditional financing—factoring, asset-based lending, supply-chain financing. Marco automates access to capital, helping businesses expand quickly and flexibly, especially for those underserved by traditional banking financing."
    },
    "pmPartners": {
      "description": "Australian consulting and training company in project management, specializing in traditional, Agile, and hybrid approaches. Provides advisory, delivery, resourcing, and training (PRINCE2, SAFe, Scrum, etc.), helping organizations execute strategies, enhance competencies, reduce risks and costs."
    },
    "glamp": {
      "description": "Online platform for booking glamping sites across Ukraine. It combines comfort and nature, offering over 1000 options for recreation. Users can easily book places through the website, make secure payments, and enjoy personalized service. The goal is to make active recreation accessible, quality, and carefree."
    },
    "lemonSquizy": {
      "description": "AI platform for business that automatically analyzes documents, extracts key data, identifies patterns, and provides recommendations. Helps reduce manual work, make real-time decisions, and ensures data security."
    }
  }
}