{
  "main": {
    "name": "Данііл Дорошенко",
    "description": "Розробник, що створює сучасні, адаптивні веб-додатки за допомогою React, Next.js та передових технологій. Зосереджений на створенні виняткового користувацького досвіду через чистий код та інноваційні дизайнерські рішення.",
    "downloadCv": "Завантажити CV",
    "yearsOfExperience": "Років досвіду",
    "projects": "Проекти",
    "technologies": "Технології",
    "landings": "Лендінги"
  },
  "header": {
    "btnContact": "Співпраця",
    "nav": {
      "home": "Головна",
      "services": "Послуги",
      "resume": "Резюме",
      "projects": "Проекти",
      "contact": "Контакти"
    }
  },
  "services": {
    "service1": {
      "title": "Розробка вебсайтів \"під ключ\"",
      "items": [
        "Односторінкові сайти",
        "Корпоративні сайти",
        "Портфоліо, сайти-фотографів, особисті сторінки",
        "Маркетингові мікросайти"
      ]
    },
    "service2": {
      "title": "Розробка інтерфейсів вебдодатків",
      "items": [
        "Dashboard, адмін-панелі",
        "Інтерфейси SaaS-додатків",
        "Користувацькі кабінети"
      ]
    },
    "service3": {
      "title": "Інтеграція з API та бекендом",
      "items": [
        "Підключення REST API / GraphQL",
        "Авторизація та автентифікація (OAuth, JWT, Firebase)",
        "Обробка форм та відправлення даних"
      ]
    },
    "service4": {
      "title": "Оптимізація швидкодії та SEO",
      "items": [
        "SSR (Server-Side Rendering)",
        "SSG (Static Site Generation)",
        "Оптимізація зображень і шрифтів",
        "Метадані, OpenGraph, SEO-структура"
      ]
    },
    "service5": {
      "title": "Адаптивна верстка",
      "items": [
        "Оптимізація під мобільні пристрої",
        "Кросбраузерна сумісність"
      ]
    },
    "service6": {
      "title": "Підключення сторонніх сервісів",
      "items": [
        "Google Analytics, Hotjar",
        "Stripe, PayPal",
        "EmailJS, Formspree, Netlify Forms"
      ]
    },
    "service7": {
      "title": "Міграція сайтів або додатків",
      "items": [
        "Перенесення проектів з Create React App до Next.js",
        "Міграція HTML/WordPress сайтів до React/Next"
      ]
    },
    "service8": {
      "title": "Рефакторинг та технічна підтримка",
      "items": [
        "Перепис коду з class components на hooks",
        "Розділення коду (code splitting)",
        "Підвищення продуктивності"
      ]
    },
    "service9": {
      "title": "Компонентна розробка",
      "items": [
        "Розробка та документування компонентів",
        "Дизайн-системи та UI-бібліотеки"
      ]
    }
  },
  "contact": {
    "title": "Давайте працювати разом",
    "description": "Готовий втілити ваші ідеї в життя за допомогою сучасних технологій. \n Зв'яжіться зі мною, щоб обговорити ваш проект.",
    "form": {
      "firstName": "Ім'я",
      "lastName": "Прізвище",
      "email": "Email адреса",
      "phone": "Номер телефону",
      "selectService": "Оберіть послугу",
      "message": "Напишіть ваше повідомлення тут",
      "sendMessage": "Надіслати повідомлення"
    },
    "info": {
      "phone": "Телефон",
      "email": "Пошта"
    },
    "services": {
      "service1": "Розробка вебсайтів \"під ключ\"",
      "service2": "Розробка інтерфейсів вебдодатків",
      "service3": "Інтеграція з API та бекендом",
      "service4": "Оптимізація швидкодії та SEO",
      "service5": "Адаптивна верстка",
      "service6": "Підключення сторонніх сервісів",
      "service7": "Міграція сайтів або додатків",
      "service8": "Рефакторинг та технічна підтримка",
      "service9": "Компонентна розробка",
      "service10": "Інше"
    }
  },
  "resume": {
    "tabs": {
      "experience": "Досвід",
      "skills": "Навички",
      "about": "Про мене"
    },
    "about": {
      "title": "Про мене",
      "description": "Я Frontend-розробник, якому важливо не просто писати код, а створювати рішення, що приносять реальну користь людям. Мене драйвить ідея поєднання естетики та функціональності — щоб інтерфейси були не лише красивими, а й інтуїтивно зрозумілими. Люблю працювати в команді, де цінується відкритість, обмін знаннями та спільне прагнення до якості. Вмію слухати, швидко адаптуюсь до нових умов і завжди шукаю способи зробити продукт кращим. У роботі для мене важливі структура, увага до деталей і постійне самовдосконалення. Вірю, що технології — це інструмент, а справжній результат народжується там, де є співпраця, креативність і відповідальність.",
      "info": {
        "name": "Ім'я",
        "phone": "Телефон",
        "experience": "Досвід",
        "telegram": "Телеграм",
        "nationality": "Національність",
        "email": "Email",
        "freelance": "Фріланс",
        "languages": "Мови"
      },
      "values": {
        "name": "Данііл Дорошенко",
        "phone": "+380 96 014 28 71",
        "experience": "3+ роки",
        "telegram": "@DoroshenkoDan",
        "nationality": "Українець",
        "email": "doroshenko.daniil.a@gmail.com",
        "freelance": "Доступний",
        "languages": "Англійська, Українська"
      }
    },
    "skills":{
      "title": "Мої Навички",
      "description":"Тут лише основні технології. Повний список можна переглянути у моєму CV, доступному для завантаження на головній сторінці."
    },
    "experience": {
      "title": "Мій досвід",
      "description": "Фронтенд-розробник з досвідом створення сучасних, адаптивних вебзастосунків у різних галузях. Володію навичками роботи з React, Next.js та TypeScript, з особливим акцентом на оптимізацію продуктивності, чисту архітектуру та орієнтацію на користувача. Маю досвід повного циклу розробки — від аналізу вимог і реалізації інтерфейсу до інтеграції API та розгортання. Успішно співпрацював з міжнародними клієнтами та міжфункціональними командами, постійно дотримуючись термінів і забезпечуючи високу якість коду.",
      "born2codelab": "Я долучився до розробки масштабних вебплатформ у сферах туризму, фінансів та безпеки. Основна увага приділялася створенню інтуїтивно зрозумілих інтерфейсів та надійної бізнес-логіки, адаптованої до потреб різних користувачів. Ключові проєкти: Туристична платформа — Спроєктував зручний інтерфейс для мандрівників та потужну панель керування для власників нерухомості, що дозволяє управляти бронюваннями, аналітикою та комунікацією з клієнтами. Фінансова платформа для експортерів — Створив технологічне рішення для малого та середнього бізнесу, яке оптимізує фінансові операції, покращує доступ до інструментів підтримки експорту та забезпечує прозорість транзакцій. Платформа безпеки на основі ШІ — Розробив інноваційну систему, що використовує штучний інтелект для оцінки ризиків, реагування на інциденти та забезпечення розширеного захисту організацій. Брав участь у всіх етапах розробки — від планування архітектури та створення UI до інтеграції API та розгортання. Тісно співпрацював з дизайнерами, бекенд розробниками та менеджерами продукту для забезпечення продуктивності, адаптивності та відповідності найкращим практикам UI/UX.",
      "upwork": "Розробляв широкий спектр проєктів — від лендингів і промо-сайтів до складних вебзастосунків із динамічною функціональністю. Брав участь у всіх етапах розробки, включаючи аналіз вимог, проєктування архітектури, реалізацію UI, інтеграцію API та розгортання. Працював як самостійно, так і в командах, підтримуючи активну комунікацію з клієнтами, готуючи оцінки та звіти, і стабільно дотримуючись термінів. Регулярно оптимізував продуктивність, оновлював кодову базу, впроваджував нові UI рішення та забезпечував відповідність рекомендаціям UI/UX. Цей досвід значно поглибив мої технічні знання, зміцнив здатність приймати самостійні рішення та покращив навички співпраці з клієнтами з різних галузей.",
      "toptal": "Працював у міжфункціональній команді над розробкою невеликих односторінкових сайтів та легких e-commerce рішень. Використовував React для забезпечення адаптивного дизайну, швидкого завантаження та інтеграції з API. Брав участь у повному циклі розробки — від верстки до розгортання. Реалізовував анімації (Framer Motion), працював із формами за допомогою Formik та Yup, підтримував якість коду за допомогою ESLint, Prettier, Stylelint та CI з Husky. Отримав досвід швидкої розробки, командної роботи та гнучкого планування.",
      "durations": {
        "born2codelab": "Червень 2024 - Липень 2025",
        "upwork": "Червень 2023 - Липень 2024",
        "toptal": "Лютий 2022 - Червень 2023"
      }
    }
  },
  "projects": {
    "peakDefence": {
      "description": "AI-платформа та методологія для кібербезпеки, що поєднує штучний інтелект, графові технології та експертну підтримку. Wingman AI автоматизує управління безпекою, пріоритезує ризики, знижує шум сповіщень і забезпечує відповідність стандартам. Додатково пропонуються послуги Virtual-CISO, управління відповідністю та ризиками."
    },
    "marco": {
      "description": "Фінтех-платформа, що спрощує зовнішню торгівлю, пропонуючи SME-компаніям нестандартне фінансування—факторинг, кредитування під активи, supply-chain фінансування. Marco автоматизує доступ до капіталу, допомагаючи розширювати бізнес швидко та гнучко, особливо для тих, хто недоступний для банківського фінансування."
    },
    "pmPartners": {
      "description": "Австралійська консалтинг-та навчальна компанія в сфері управління проєктами, спеціалізується на традиційних, Agile та гібридних підходах. Надає advisory, delivery, resourcing та тренінги (PRINCE2, SAFe, Scrum тощо), допомагає організаціям виконувати стратегії, підвищувати компетенції, знижувати ризики та витрати."
    },
    "glamp": {
      "description": "Онлайн-платформа для бронювання глемпінгів по всій Україні. Вона поєднує комфорт і природу, пропонуючи понад 1000 варіантів для відпочинку. Користувачі можуть легко бронювати місця через сайт, здійснювати безпечні платежі та насолоджуватись індивідуальним сервісом. Мета — зробити активний відпочинок доступним, якісним і безтурботним."
    },
    "lemonSquizy": {
      "description": "AI-платформа для бізнесу, яка автоматично аналізує документи, витягує ключові дані, виявляє закономірності та надає рекомендації. Допомагає зменшити ручну роботу, приймати рішення на основі реального часу та гарантує безпеку даних."
    }
  }
}